Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: However, all implementations MUST support a minimal set of algorithms to ensure interoperability (this does not imply that the local policy on all hosts would necessarily allow these algorithms).
ja: しかし, すべての実装は相互運用性を保証する最小限のアルゴリズムのセットをサポートしなければらならない(これはすべてのホストのローカルなポリシーがこれらのアルゴリズムを許可しなければならない, ということは意味しない).

source: However, as there is no widely deployed key infrastructure available on the Internet at the time of this writing, this option makes the protocol much more usable during the transition time until such an infrastructure emerges, while still providing a much higher level of security than that offered by older solutions (e.g., telnet [RFC0854] and rlogin [RFC1282]).
ja: しかしながら, 執筆時点でインターネット上に広く配置されている鍵基盤は存在しない. そのような基盤が現れるまでの移行期間では, この選択肢を選択することはプロトコルをより有用にする. さらに, この選択肢は, より古い解決策(たとえば, telnet [RFC0854] や rlogin [RFC1282])が提供するよりも高いセキュリティレベルを提供できる..

source: When Ethernet headers are considered, the increase is less than 10 percent.
ja: イーサネットのヘッダも考慮すると, 増大は10%よりも少ない.

source: The proposed groups need not be fixed and can change with time.
ja: この提案された群は固定される必要はなく時間とともに変化できます.

source: The protocol provides the option that the server name - host key association is not checked when connecting to the host for the first time.
ja: プロトコルは, サーバ名とホスト鍵の関連を初回の接続時にはチェックしないという選択肢も提供する.

source: When an SNMP entity uses the snmpSSHDomain Transport Model, it must be capable of accepting messages up to and including 8192 octets in size.
ja: SNMP エンティティが snmpSSHDomain トランスポートモデルを使う場合, サイズ 8192 オクテットまでのメッセージを受け取る能力がなければならない.

source: It is RECOMMENDED that the algorithms be sorted by cryptographic strength, strongest first.
ja: アルゴリズムを暗号学的に最も強いものから降順に並べることを推奨する.

source: If a client passes 0 as port number to bind and has 'want reply' as TRUE, then the server allocates the next available unprivileged port number and replies with the following message; otherwise, there is no response-specific data.
ja: クライアントが port number to bind として 0を 'want reply' として TRUE を指定した場合, サーバは次に利用可能な特権ポートではないポートを割り当て次のメッセージで返信する. 割り当てなければ返信しない. response-specific data.

source: IANA Considerations ...........................................14 11.
ja: IANA の考慮 ..............................................14 11.

source: The reader is referred to [RFC5280] for a general description of X.509 version 3 certificates.
ja: X.509 バージョン 3 証明書の一般的な説明は [RFC5280] にある.

source: GSS-API Authentication Overview
ja: GSS-API 認証の概要

source: SSH implementations SHOULD also attempt to rekey before receiving more than 2**32 packets since the last rekey operation.
ja: また, 最後の鍵の再生成の操作をしてから2**32個以上のパケットを受信する前にSSHの実装は再生成を試みる必要がある.

source: Method Names
ja: 方法の名前

source: When the client's call to GSS_Init_sec_context() returns GSS_S_COMPLETE with the integ_avail flag set, the client MUST conclude the user authentication exchange by sending the following message:
ja: GSS_Init_sec_context() のクライアントの呼び出し結果が GSS_S_COMPLETE で integ_avail フラグが設定されているなら、 クライアントは 次のメッセージを送ってユーザ認証の交換を成立させなければらならない.

source: The client-to-server channel and the server-to-client channel will have independent keys and initialization vectors.
ja: クライアントからサーバへのチャンネルとサーバからクライアントへのチャンネルは, 独立した鍵と初期化ベクトルを持つ.

source: The purpose of this message is to ensure that a party is able to respond with an SSH_MSG_DISCONNECT message that the other party can understand if something goes wrong with the key exchange.
ja: このメッセージの目的は, 鍵交換で何か問題があったかどうかを相手側が理解できるように SSH_MSG_DISCONNECT メッセージを返信できることを保証することだ.

source: o If the KeyUsage extension is present in a certificate for the x509v3-ssh-dss, x509v3-ssh-rsa, x509v3-rsa2048-sha256, or x509v3- ecdsa-sha2-* public key algorithms, then the digitalSignature bit MUST be set.
ja: o x509v3-ssh-dss ないし, x509v3-ssh-rsa, x509v3-rsa2048-sha256, x509v3-ecdsa-sha2-* 公開鍵アルゴリズムのための証明書に KeyUsage 拡張が存在したら, digitalSignature ビットは設定されなければならない.

source: o I_C is C's KEXINIT message, and I_S is S's KEXINIT message
ja: o I_C は C の KEXINIT メッセージ, I_S は S の KEXINIT メッセージだ.

source: The client software MAY display this message to the user.
ja: クライアントソフトウェアは, ユーザにこのメッセージを表示してもよい.

source: An IPv6 address must be in colon-separated format, surrounded by square brackets ('[', US-ASCII character 0x5B, and ']', US-ASCII character 0x5D), followed by a colon ':' (US-ASCII character 0x3A) and a decimal port number in US-ASCII.
ja: IPv6 アドレスは, コロン区切り形式で, 角括弧 ('[', US-ASCII 文字 と ']', US-ASCII 文字 0x5D) で囲まれ, コロン ':' (US-ASCII 文字 0x3A) と US-ASCIIの10進のポート番号が続かなければならない.

source: Key Exchange Messages
ja: 鍵交換のメッセージ

source: 92 PARENB Parity enable.
ja: 92 PARENB パリティ有効

source: The hashing algorithm defined by this family of method names is the SHA2 family of hashing algorithms [FIPS-180-3].
ja: このファミリで定義されるハッシュアルゴリズムは, SHA2ファミリのハッシュアルゴリズム [FIPS-180-3] だ.

source: This document still uses the EOM sequence for the initial <hello> message to avoid incompatibility with existing implementations.
ja: この文書は, 既存の実装との非互換を避けるために, 最初の <hello> メッセージで EOM 文字列をまだ利用している.

source: The format of the part preceding the at-sign is not specified; however, these names MUST be printable US-ASCII strings, and MUST NOT contain the comma character (","), or whitespace, or control characters (ASCII codes 32 or less).
ja: アットマークの前の部分の形式は指定されていない; しかし, 表示可能な US-ASCIIの文字列で, コンマ (","), スペース, 制御文字(ASCIIコード 32以下) を含んではならない.

source: This section specifies identifiers encoding named elliptic curve domain parameters.
ja: この節では, 指定された楕円曲線ドメインパラメータをエンコードする識別子を指定する.

source: Using AES-GCM to provide both confidentiality and data integrity is generally more efficient than using two separate algorithms to provide these security services.
ja: 機密性とデータ完全性の両方を提供するために AES-GCM を利用することは, これらのセキュリティサービスを提供するために 2つの別のアルゴリズムを用いるよりも一般的に効率的だ.

source: Furthermore, the shared secret is known only to the participant parties.
ja: さらに, 共有の秘密は参加している当事者のみがわかる.

source: It is thus RECOMMENDED that Arcfour (either in the form described here or that described in [RFC4251]) not be used for high-volume password- authenticated connections.
ja: よって, (この文書で記述したものも [RFC4251]で記述したものもどちらも) Arcfour は大量のパスワード認証接続に利用しないよう推奨する.

source: Key File Header ............................................3 3.3.1.
ja: 鍵ファイルのヘッダ ............................................3 3.3.1.

source: We note that this is no different from other key enrollment situations, e.g., a client sending a certificate request to a certificate authority for signing.
ja: たとえば, 署名のために認証の要求をクライアントが認証機関に送る場合などの, 他の鍵の登録の場合と同じだということを注記しておく.

source: These curves are defined in [SEC2]; the NIST curves were originally defined in [NIST-CURVES].
ja: これらの曲線は [SEC2]で定義されている; NISTの曲線はもともと [NIST-CURVES]で定義されている.

source: Using tmTransportAddress, the client will establish an SSH transport connection using the SSH transport protocol, authenticate the server, and exchange keys for message integrity and encryption.
ja: tmTransportAddress を用いて, クライアントは SSHトランスポートプロトコルを用いてトランスポート接続を確立し, サーバを認証し, メッセージ完全性と暗号化のための鍵を交換する.

source: If a server sends both this message and an SSH_MSG_USERAUTH_GSSAPI_ERROR message, the SSH_MSG_USERAUTH_GSSAPI_ERROR message MUST be sent first, to allow the client to store and/or display the error status before processing the error token.
ja: このメッセージと SSH_MSG_USERAUTH_GSSAPI_ERROR メッセージをサーバが両方送る場合, SSH_MSG_USERAUTH_GSSAPI_ERROR メッセージを最初に送らなければならない. エラートークンを処理する前にクライアントがエラー状態を保持する かつ/もしくは 表示できるようにするためだ.

source: For example: the value 699921578 (0x29b7f4aa) is stored as 29 b7 f4 aa.
ja: 例: 699921578 (0x29b7f4aa) は 29 b7 f4 aa として格納される.

source: o Key format: how is the key encoded and how are certificates represented.
ja: o 鍵フォーマット: どのように鍵がエンコードされ証明書が示されるか.

source: The Secure Shell Transport Model provides the following ASI to close a session:
ja: セキュアシェルトランスポートモデルは, セッションを終了するため次の ASI を提供する:

source: In Suite B, public key certificates used to verify signatures MUST be compliant with the Suite B Certificate Profile specified in RFC 5759 [SUITEBCERT].
ja: Suite B では, 署名を検証するのに用いられる公開鍵証明書は, RFC5759 [SUITEBCERT] で指定された Suite B 公開鍵プロファイルに準拠していなければならない..

source: Conventions for Names ..............................13 4.6.2.
ja: 命名規約..............................13 4.6.2.

source: string service_name // service name in US-ASCII
ja: string service_name // US-ASCII でのサービス名

source: The algorithm from the SHA2 family that will be used is chosen based on the size of the named curve specified in the method name according to the table in Section 6.2.1.
ja: SHA2ファミリからどのアルゴリズムが選ばれるかは, 6.2.1節の表に基づいて方法の名前で指定された曲線のサイズを元に決められる.

source: The IANA will not assign Channel Connection Failure 'reason code' values in the range of 0xFE000000 to 0xFFFFFFFF.
ja: IANAは, 0xFE000000 から 0xFFFFFFFF の範囲のチャンネル接続失敗の'reason code' の値は割り当てない.

source: This document does not define any new protocols.
ja: この文書は, 新しいプロトコルは定義していない.

source: However, since the 'message' is likely to be sent for every login attempt, and since some client software will need to open a separate window for this warning, the client software may allow the user to explicitly disable the display of banners from the server.
ja: しかしながら, 'message' はすべてのログインの試行に対して送られるだろうし, この警告のために別のウィンドウを開く必要のあるクライアントもあるだろう. このため, クライアントのソフトウェアは, ユーザがサーバからのバナーの表示を明示的に無効できるようにしてもよい.

source: Output from Key Exchange ..................................20 7.3.
ja: 鍵交換からの出力................................20 7.3.

source: Compute p := 2q + 1, and test whether p is prime (using, e.g., trial division and the Rabin-Miller test).
ja: p := 2q + 1 を計算し, p が素数かテスト (たとえば除算の試行とRabin-Millerテストを用いて)

source: This risk can be mitigated by the use of passphrases on private keys; however, this is not an enforceable policy.
ja: このリスクは, 秘密鍵にパスフレーズを付けることで緩和できるが, 強制できるポリシーではない.

source: After successful authentication, such messages are passed to the higher-level service.
ja: 認証が成功したら, これらのメッセージは高位のサービスに送られる.

source: In addition, the transport protocol provides a unique session identifier (bound in part to pseudo-random data that is part of the algorithm and key exchange process) that can be used by higher level protocols to bind data to a given session and prevent
ja: 加えて, トランスポートプロトコルは, ユニークなセッション識別子を提供する. (セッション識別子は, アルゴリズムと鍵交換のプロセスに必要な擬似乱数データにある程度束縛される) セッション識別子は, より上位のプロトコルで, データを特定のセッションに束縛し以前のセッションからのデータのリプレイを防ぐ.

source: The RECOMMENDED timeout period is 10 minutes.
ja: タイムアウト期間の推奨は, 10分だ.

source: If this is a client-side SSH session, then the tmSecurityName MUST be set to the tmSecurityName used to establish the session.
ja: クライアント側の SSH のセッションの場合は, この tmSecurityName は セッションを確立するために用いられた tmSecurityName に設定される.

source: 73 OCRNL Translate carriage return to newline (output).
ja: 73 OCRNL 出力で, CRをNLに置き換える.

source: The contents of these bytes could reveal information about the key.
ja: これらのバイト列の内容は, 鍵の情報を漏らす可能性がある.

source: * If the resulting major_status code is GSS_S_COMPLETE and both the mutual_state and integ_avail flags are true, the resulting output token is sent to S.
ja: * 結果の major_status コードが GSS_S_COMPLETE で mutual_state と integ_avail フラグが共に trueなら, 結果のoutput tokenをSに送る.

source: GCM Authenticated Encryption
ja: AES GCM の認証付き暗号化

source: Names are case- sensitive, and MUST NOT be longer than 64 characters.
ja: 名前は大文字小文字が区別され, 64文字以下でなければならない.

source: A number of major computer equipment vendors provide high-level administrative functions through an asynchronous serial port and generally expect the attached terminal to be capable of sending a BREAK signal.
ja: 多数のメジャーな計算機機器ベンダーが, 非同期シリアルポートを通じた高レベルの管理機能を提供している. そして, 接続されたターミナルに BREAK シグナルを送る能力があることを一般的に期待している.

source: The hashing algorithm is defined in the method name to allow room for other algorithms to be defined in future documents.
ja: ハッシュアルゴリズムは, 方法の名前で定義される. その他のアルゴリズムを許可する余地があるかどうかは, 将来の文書で定義される.

source: The data types used in the packets are defined in the SSH architecture document [SSH-ARCH].
ja: パケットで利用しているデータのタイプは, アーキテクチャ文書 [SSH-ARCH] で定義されている.

source: It does this by having the server compute a MIC of the list of mechanisms proposed by the client, and then checking that value at the client.
ja: クライアントが提案したメカニズムのリストから MIC をサーバが計算して クライアントがその値をチェックすることで行なわれる.

source: The stream consists of opcode- argument pairs wherein the opcode is a byte value.
ja: ストリームは, opcodeがバイトの値である opcode-argumentのペアで構成される.

source: The choice of all but the user authentication methods are determined by the exchange of SSH_MSG_KEXINIT between the client and the server.
ja: ユーザ認証法をのぞくすべての(アルゴリズムの)選択は, クライアントとサーバ間での SSH_MSG_KEXINIT の交換で決定される.

source: The client SHOULD send GSS-API mechanism OIDs only for mechanisms that are of the same priority, compared to non-GSS-API authentication methods.
ja: クライアントは 非 GSS-API な認証法と同じ優先度の GSS-API メカニズム OID のみを送信する必要がある．

source: Certificate Extensions .
ja: 証明書の拡張 .

source: Many people shy away from counter mode-based encryption schemes because, when used incorrectly (such as when the keystream is allowed to repeat), counter mode can be very insecure.
ja: 多くの人がカウンターモードベースの暗号方式を避けている. 正しく利用しないと(鍵ストリームの繰り返しが許可されている場合など), カウンターモードは非常に危険となりうるからだ.

source: 128 TTY_OP_ISPEED Specifies the input baud rate in bits per second.
ja: 128 TTY_OP_ISPEED bit/秒単位で入力バンドレートを指定する.

source: Additionally, recommendation (2) is designed to protect an encryptor from encrypting more than 2**L blocks with the same key.
ja: また, 推奨 (2) は 同じ鍵で 2**L ブロックより多く暗号化する暗号者を保護するために設計されている.

source: The first algorithm on the client's name-list that satisfies the requirements and is also supported by the server MUST be chosen.
ja: クライアントの名前リストの最初のアルゴリズムが, この必要条件を満たしサーバもサポートしているなら, 選ばれなければならない.

source: The file format described by this document provides no mechanism to verify the integrity or otherwise detect tampering with the data stored in such files.
ja: この文書で記述したファイル形式は, 完全性を検証したり, もしくはファイルに保存されたデータの改竄を検知したりするメカニズムを提供しない.

source: The Message Number is a byte value that describes the payload of a packet.
ja: メッセージ番号は, パケットのペイロードを示すbyteの値だ.

source: X11 forwarding may be requested for a session by sending a SSH_MSG_CHANNEL_REQUEST message.
ja: X11の転送は, セッションに SSH_MSG_CHANNEL_REQUEST メッセージを送ることで要求される.

source: Requests to open a channel contain the sender's channel number.
ja: チャンネルを開始する要求は, 送り手のチャンネル番号を含む.

source: If SSH host key verification can be configured to require SSHFP, SSH host key revocation can be implemented by removing the corresponding SSHFP from DNS.
ja: SSH ホスト鍵認証に SSHFP が必要だと設定可能ならば, SSH のホスト鍵の廃止は DNS上の関連する SSHFP を除去することで実装できる.

source: Compared to cryptosystems such as RSA, the Digital Signature Algorithm (DSA), and Diffie-Hellman (DH) key exchange, ECC variations on these schemes offer equivalent security with smaller key sizes.
ja: RSAや Digital Signature Algorithm (DSA), Diffie-Hellman (DH) 鍵交換のような暗号システムに比べて, これらの方式のECCでのバリエーションは, より小さい鍵サイズで同等のセキュリティを提供する.

source: The method name of the key exchange chosen determines the elliptic curve domain parameters and hash function to be used in the remainder of this section.
ja: 選ばれた鍵交換の方法名は, この節の残りで用いる楕円曲線ドメインパラメータとハッシュ関数を決定する.

source: The SSH user authentication method name "gssapi" is to be reserved, in order to avoid conflicts with implementations supporting an earlier version of this specification.
ja: SSH ユーザ認証法名 "gssapi" は予約される. この実装の以前のバージョンをサポートする実装との衝突を避けるためだ.

source: Table 2 lists three allowable name lists for the non-signature algorithms.
ja: 表 2 は, 署名以外のアルゴリズムの3つの受け入れられる name-list を示す.

source: o Assigned Algorithm Names * Encryption Algorithm Names * MAC Algorithm Names * Public Key Algorithm Names * Compression Algorithm Names
ja: o 割当てられたアルゴリズムの名前 * 暗号アルゴリズム名 * MACアルゴリズム名 * 公開鍵アルゴリズム名 * 圧縮アルゴリズム名

source: In practice, a BREAK signal is typically 250 to 500 ms in length.
ja: 実際には, BREAK 信号は典型的に 250から500 msの長さだ .

source: The corresponding transport address is of type SnmpSSHAddress.
ja: 対応する トランスポートアドレスは, タイプ SnmpSSHAddress だ.

source: The user (or application) can parse this message to determine which NETCONF capabilities are supported by the server.
ja: ユーザ(もしくはアプリケーション)はこのメッセージをパースして, どの NETCONF 機能がサーバでサポートされているかを判断できる.

source: * If the resulting major_status code is GSS_S_COMPLETE and the integ_avail flag is not true, then per-message integrity protection is not available, and the key exchange MUST fail.
ja: * 結果の major_status コードが GSS_S_COMPLETE で integ_avail フラグが trueでなければ, メッセージ単位の完全性保護が利用できないので鍵交換は失敗しなければならない.

source: Host Keys ..................................................4 4.2.
ja: ホスト鍵 ..................................................4 4.2.

source: The naming of opcode values mostly follows the POSIX terminal mode flags.
ja: opcode 値の名前は, POSIX 端末モードのフラグにだいたい従っている.

source: tmTransportAddress = the derived tmTransportAddress from step 2.
ja: tmTransportAddress = ステップ2から導出された tmTransportAddress

source: The protocol has been designed to be simple and flexible to allow parameter negotiation, and to minimize the number of round-trips.
ja: プロトコルは, パラメータのネトシエーションや往復の回数を最小限にするように単純で柔軟に設計されている.

source: Terminology .
ja: 用語 .

source: An agent will process RPC messages from the manager in the order in which they are received.
ja: エージェントは, マネージャから送られる RPC メッセージを受け取った順に処理する.

source: Diffie-Hellman Key Exchange ....................................21 8.1.
ja: Diffie-Hellman 鍵交換..................................21 8.1.

source: Upon connection to an SSH server, the SSH client MAY look up the SSHFP resource record(s) for the host it is connecting to.
ja: SSH サーバへの接続で, SSH クライアントは接続中のホストの SSHFP リソースレコードを検索してもよい.

source: The initial assignments are given in their respective sections.
ja: 初期の割り当ては, それぞれの節で与えられる.

source: MIB Modules Required for IMPORTS
ja: IMPORTS に必要な MIB モジュール

source: The name SHOULD be fully qualified whenever possible.
ja: 名前は, 可能な限り完全修飾されている必要がある.

source: The server then responds with the following:
ja: サーバは次のメッセージで応答する:

source: Based on projections of computation power, it is possible to estimate the running time of the best known attacks based on the size of the finite field.
ja: 計算能力の予測に基づいて, 有限体のサイズに基づくもっとも良い既知の方法の時間を見積もれる.

source: o the kex algorithm and/or the host key algorithm is guessed wrong (server and client have different preferred algorithm), or
ja: o 鍵交換アルゴリズムと/ないしホスト鍵のアルゴリズムが間違って推測された(サーバとクライアントが異なる優先アルゴリズムを持つ), ないし

source: IANA Considerations .............................................9 10.
ja: IANA の考慮 .............................................9 10.

source: Each line SHOULD be terminated by a Carriage Return and Line Feed.
ja: それぞれの行は, キャリッジリターンとラインフィードで終端されている必要がある.

source: Note that while SecSh-B MUST follow the guidance in this document, that requirement does not in and of itself imply that a given implementation of Secure Shell is suitable for use in protecting classified data.
ja: SecSh-B はこの文書のガイダンスに従わなければならないが, この要求自体は, セキュアシェルの特定の実装が機密情報を保護する目的に適しているかを意味していないことに注意.

source: Names with the at-sign in them will have the format of "name@domainname" (without the double quotes) where the part preceding the at-sign is the name.
ja: アットマークを含む名前は, "name@domainname" (ダブルクォーテーションを除く) という形式だ. アットマークに先行する部分が(狭い意味での)名前だ.

source: Password Authentication Method: "password"
ja: パスワード認証法: "password"

source: The transportAddress associated with a session MUST remain constant during the lifetime of the SSH session.
ja: セッションに関連する transportAddress は, SSHのセッションの生存中一定でなければならない.

source: As always, implementers and users should check current literature to ensure that no recent vulnerabilities have been found in ciphers used within products.
ja: 実装者とユーザは, 常に, 製品に利用している暗号に新しい脆弱性が見付かっていないことを保証するために最近の文献をチェックする必要がある.

source: Note that the server MAY require additional authentications after successful authentication.
ja: 成功した認証のあとで, サーバは追加の認証を要求してもよいことを注記しておく.

source: Using NETCONF over SSH ..........................................5 5.
ja: SSH 上での NETCONF の利用 ..........................................5 5.

source: Provided that the IV for the second SSH Record is fixed after the data for the Data packet is determined, then the following should be performed:
ja: Dataパケットのデータが決定してから2番目のSSH RecordのIVは決められる. 次の操作が実行される:

source: The transport protocol [SSH-TRANS] provides a confidential channel over an insecure network.
ja: トランスポートプロトコル [SSH-TRANS] は, 安全でないネットワーク上で秘密のチャンネルを提供する.

source: Following the last "attribute" response, a status packet MUST be sent.
ja: 最後の "attribute" 応答に続いて, 状態パケットが送られなければならない.

source: Thus, no place is provided for directly specifying the character set or encoding for terminal session data.
ja: このため, 端末セッションのデータの文字セットやエンコーディングを直接指定する方法は提供されない.

source: The Dispatcher passes the information to the Transport Model using the ASI defined in the Transport Subsystem:
ja: Dispatcher は, トランスポートサブシステムで定義された ASI を用いてトランスポートモデルに情報を渡す.

source: SSH_MSG_KEXINIT S->C Contains lists of algorithms acceptable to the server.
ja: SSH_MSG_KEXINIT S->C サーバが受け入れられるアルゴリズムのリストを含む.

source: Users and administrators SHOULD be explicitly warned anytime the "none" MAC is enabled.
ja: ユーザや管理者に, "none" MACが有効な時はいつでも明示的に警告する必要がある.

source: Host-based authentication assumes that the client has not been compromised.
ja: ホストベース認証は, クライアントが侵害されていないことを前提とする.

source: When an x509v3-ecdsa-sha2-* user authentication method is being used, the structure of the SSH_MSG_USERAUTH_REQUEST message should be:
ja: x509v3-ecdsa-sha2-* ユーザ認証法を用いる場合, SSH_MSG_USERAUTH_REQUEST メッセージの構造は次のようでなければならない:

source: Initial Assignments ................................10 4.4.3.
ja: 初期の割り当て ................................10 4.4.3.

source: Every compliant SSH ECC implementation MUST implement this public key format.
ja: すべての準拠する SSH ECC 実装は, この公開鍵フォーマットを実装しなければならない.

source: Cached Information and References ..............................13 4.1.
ja: キャッシュされる情報とリファレンス ..............................13 4.1.

source: The Secure Shell (SSH) Connection Protocol
ja: セキュアシェル（SSH）接続プロトコル

source: The reader is referred to [SSH-GCM] for details on the format, initialization, and usage of these counters and their relationship to the initialization vector and the SSV.
ja: フォーマットや初期化, これらのカウンタの利用法, 初期化ベクトルと SSV との関係についての詳細は [SSH-GCM] を参照.

source: The identification MUST be terminated by a single Carriage Return (CR) and a single Line Feed (LF) character (ASCII 13 and 10, respectively).
ja: この識別文字列は, 単一のキャリッジリターン (CR) と単一のラインフィード （LF) (それぞれ ASCII の 13 と 10) で終了されなければならない.

source: mac Message Authentication Code.
ja: mac メッセージ認証コード.

source: All Public Key Subsystem requests and responses are sent in the following form:
ja: すべての公開鍵サブシステムの要求と応答は以下の形式で送られる.

source: While it is understood that the IANA will have no control over the range of 0xFE000000 to 0xFFFFFFFF, this range will be split in two parts and administered by the following conventions.
ja: 0xFE000000 to 0xFFFFFFFF の範囲についてはIANAはなんの制御もしないが, この範囲は次の規約に従って2つの部分に分割されて管理される.

source: IANA added the following two entries to the secure shell Encryption Algorithm Names registry described in [RFC4250]:
ja: IANA は, [RFC4250] で記述された secure shell Encryption Algorithm Names registry に以下の2つのエントリを追加した.

source: The minimum packet size is in the order of 28 bytes (depending on negotiated algorithms).
ja: 最小のパケットサイズは, 28 byteのオーダーだ (取り決められるアルゴリズムに依存する).

source: This entire document is the IANA considerations for the SSH protocol, as defined in [SSH-ARCH], [SSH-TRANS], [SSH-USERAUTH], [SSH-CONNECT].
ja: この文書全体が,[SSH-ARCH], [SSH-TRANS], [SSH-USERAUTH], [SSH-CONNECT]で定義されているSSHプロトコルに対するIANAの考慮だ.

source: Consistent with Section 4.9.5 of [8], this document makes the following registration:
ja: [8] の 4.9.5節と整合するため, この文書は次の登録を行なう:

source: If this attribute is specified, it MUST immediately follow a "comment" attribute and specify the language for that attribute [6].
ja: この属性が指定されているなら, "comment" 属性がすぐ次に続かなければならない. また, その "comment" 属性の言語を指定しなければならない [6].

source: As an example, the message:
ja: 例として, メッセージ:
